/**
 * Created by VLADIMIR on 31.05.2017.
 *
 * 5.3.1. Создать динамический список на базе массива.
 *  Необходимо создать контейнер с методами
 *
 *  add(E value);
 *  E get(int index);
 *  и реализовать для него Iterable<E>.
 *  Внутри контейнера должен быть массив Object[] container;
 *  Контейнер должен быть динамический. То есть метод add(E value) - может принимать бесконечное количество элементов.
 *  Внутри контейнера нельзя использовать структуры данных из JDK - ArrayList. LinkedList и другие.
 */
package ru.job4j.list.arraylist;