/**
 * Created by VLADIMIR on 13.02.2018.
 */
package ru.job4j;

/*
* Job4j / Courses / С нуля до трудоустройства / Задания / 3. Уровень - PreMiddle / Часть 010. Hibernate. / 1. Конфигурирование  /
* Сообщения : 440(106)
*   Петр Арсентьев,  31.10.16 11:54
*
*  Необходимо создать простое приложение todolist.
* 1. одна таблица в базе item. id, desc. created, done.
* 2. веб приложение должно иметь одну страницу index.html.
* 3. все данные на форму загружаються через ajax.
* 4. в верху форма. добавить новое задание. описание.
* 5. список всех заданий. и галка выполено или нет.
* 6. вверху добавить галку. показать все. если включена. то показывать все. если нет. то только те что не выполены done = false.
* 7. данные должны сохраняться через hibernate,
*
*
* */