/**
 * Created by VLADIMIR on 20.09.2017.
 */
package threads.task2;

/**
 * Job4j / Courses / Junior / Ученики / Vladimir Prilepskiy / 2. Пакет. Стандарт. / Часть 007. Multithreading / 1. Threads /
 2. Сделать ожидание вывода.[#25075]

 Необходимо, что бы вначале запуска программы из первой части на экране выводилась информация о программа. А после вычисления данных, выводилась запись о завершении программы. Важно, эта информация всегда должна выводиться в начале и в конце вычисления.
 Предусмотреть возможность останавливать вычисления, если время вычисления превышает 1 секунде. Для этого нужно реализовать проверку поведения isInterrunt()
 */