/**
 * Created by VLADIMIR on 26.02.2018.
 *
 *
 * Job4j / Courses / С нуля до трудоустройства / Задания / 3. Уровень - PreMiddle / Часть 001. Hibernate. / 2. Mapping /
 Сообщения : 446(107)
 Реализовать площадку продаж машин. [#4747]
 Петр Арсентьев,  26.11.16 20:14
 Это должно быть web приложение со следующими страницами.
 1. основная страница. таблица со всеми объявлениям машин на продажу.
 2. на странице должна быть кнопка. добавить новое объявление.
 3. переходить на страницу добавления.
 4. должны быть категории машины. марка. тип кузова и тд. посмотри как на авито сделано.
 5. важно!. можно добавлять фото. использовать библиотеку apache fileuppload
 6. объявление имеет статус продано. или нет.
 7. должны существовать пользователи. кто подал заявление. только он может менять статус.
 *
 *
 *
 Реализовать пользовательские фильтры для площадок машин [#4745]
 Петр Арсентьев,  26.01.18 21:34
 Сделай в интерфейсе список с пунктами.
 - показать за последний день
 - показать с фото
 - показать определенной марки.
 */
package ru.job4j;