/**
 * Created by VLADIMIR on 21.09.2017.
 */
package threads.task3;

/**
 * Job4j / Courses / Junior / Ученики / Vladimir Prilepskiy / 2. Пакет. Стандарт. / Часть 007. Multithreading / 1. Threads /
 3. Реализовать механизм программной остановки потока.[#25076]

 1. В программе необходимо реализовать механизм остановки нити.
 2. В программе должно быть две нити. Одна нить проверять общее время работы программы.
 Если время работы программы больше заданного времени, необходимо остановить выполнение программы.
 3. Вторая нить - это программа для подсчета символов в тексте.

 Помните, что метод Thread.interrupt() - выставлять флаг, но не останавливает нить.

 public class Time impl Runnable

 public class CountChar impl Runnable
 */