/**
 * Created by VLADIMIR on 18.07.2017.
 *
 * Job4j / Courses / Junior / Ученики / Vladimir Prilepskiy / 2. Пакет. Стандарт. / Часть 005. Collections. Pro. / 5. Map /
 *  9. Рассказать и продемонстрировать как переопределяют метод equals.[#17882]
 *
 *  Рассказать и продемонстрировать как переопределяют метод equals.
 *  Так же расписать. какие правила проверки нужно соблюдать.
 *  1. метод перестановки.
 *  2. метод зеркальной проверки.
 *  и тд. их 4 штуки. это все описано в effective java.
 *
 *
 *
 * Job4j / Courses / Junior / Ученики / Vladimir Prilepskiy / 2. Пакет. Стандарт. / Часть 005. Collections. Pro. / 5. Map /
 *  9.1. Рассказать и продемонстрировать как переопределяют метод hashCode[#17883]
 * Сообщения : 314(71)
 * 10. Рассказать и продемонстрировать как переопределяют метод hashCode.
 * описано в effective java.
 */
package ru.job4j.example;