/**
 * Created by VLADIMIR on 06.06.2017.
 *
 *
 * 5.3.2. Создать контейнер на базе связанного списка [#16036]
 *
 *    Необходимо создать контейнер с методами
 *    add(E value);
 *    E get(int index);
 *    и реализовать для него Iterable<E>.
 *    Внутри контейнера должен данные должны храниться через ссылки.
 *    Контейнер должен быть динамический. То есть метод add(E value) - может принимать бесконечное количество элементов.
 *    Внутри контейнера нельзя использовать структуры данных из JDK - ArrayList. LinkedList и другие.
 */
package ru.job4j.list.linkedlist;