/**
 * Created by VLADIMIR on 11.07.2017.
 *
 * Job4j / Courses / Junior / Ученики / Vladimir Prilepskiy / 2. Пакет. Стандарт. / Часть 005. Collections. Pro. / 5. Map /
 *  8. Реализовать собственную структуру данных - справочник.[#17881]
 *
 *
 *  Справочник должен быть унифицирован через генерики.
 *  иметь методы
 *  boolean insert(T key, V value);
 *  V get(T key);
 *  boolean delete(T key);
 *
 *  Реализовывать итератор.
 *  Внутренняя реализация должна использовать массив.
 *  нужно обеспечить фиксированное время вставки и получения.
 *
 *  Коллизии реализовывать не надо. если ключ уже есть. то возвращать false.
 *
 */
package ru.job4j.mymap;